
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>设计模式与面向对象 · 从 jQuery 中学习设计模式</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="factory-pattern.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="oop-design-pattern.html">
            
                <a href="oop-design-pattern.html">
            
                    
                    设计模式与面向对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="factory-pattern.html">
            
                <a href="factory-pattern.html">
            
                    
                    工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="adapter-pattern.html">
            
                <a href="adapter-pattern.html">
            
                    
                    适配器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="facade-pattern.html">
            
                <a href="facade-pattern.html">
            
                    
                    外观模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="composite-pattern.html">
            
                <a href="composite-pattern.html">
            
                    
                    组合模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="flyweight-pattern.html">
            
                <a href="flyweight-pattern.html">
            
                    
                    享元模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="end.html">
            
                <a href="end.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="APPENDIX.html">
            
                <a href="APPENDIX.html">
            
                    
                    附录
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >设计模式与面向对象</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x9762;&#x5411;&#x5BF9;&#x8C61;">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x9762;&#x5411;&#x5BF9;&#x8C61;</h1>
<h2 id="&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x96BE;&#x70B9;">&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x96BE;&#x70B9;</h2>
<p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x60F3;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x5B66;&#x4F1A;&#x7684;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x80FD;&#x591F;&#x628A;&#x5B83;&#x7528;&#x5728;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x6539;&#x8FDB;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x7684;&#x5C31;&#x66F4;&#x5C11;&#x3002;&#x6211;&#x603B;&#x7ED3;&#xFF0C;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x4E3B;&#x8981;&#x96BE;&#x70B9;&#x6709;&#x56DB;&#x4E2A;&#xFF1A;</p>
<p>&#x7B2C;&#x4E00;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x57FA;&#x672C;&#x8BED;&#x6CD5;&#xFF0C;&#x5B66;&#x4E60;&#x4E4B;&#x540E;&#x4E5F;&#x672A;&#x5FC5;&#x80FD;&#x7ACB;&#x523B;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x90FD;&#x6709;&#x9002;&#x7528;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x975E;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x5F3A;&#x884C;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x53EA;&#x4F1A;&#x4E8B;&#x500D;&#x529F;&#x534A;&#x3002;&#x6240;&#x4EE5;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x4E30;&#x5BCC;&#x7684;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x3001;&#x89C1;&#x8FC7;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x624D;&#x80FD;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x624D;&#x80FD;&#x81EA;&#x5982;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#xFF0C;&#x6BD4;&#x8D77;&#x4E00;&#x822C;&#x7684;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x62BD;&#x8C61;&#x5C42;&#x7EA7;&#x66F4;&#x9AD8;&#xFF0C;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x5FC3;&#x601D;&#x53BB;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5173;&#x4E4E;&#x7684;&#x662F;&#x80FD;&#x4E0D;&#x80FD;&#x5199;&#x597D;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x80FD;&#x4E0D;&#x80FD;&#x5199;&#x51FA;&#x7A0B;&#x5E8F;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x613F;&#x610F;&#x82B1;&#x65F6;&#x95F4;&#x7422;&#x78E8;&#x600E;&#x4E48;&#x6837;&#x624D;&#x628A;&#x7A0B;&#x5E8F;&#x5199;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<blockquote>
<p>&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x4E1A;&#x52A1;&#x6C34;&#x5E73;&#xFF0C;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x6B63;&#x5728;&#x8BA4;&#x771F;&#x9605;&#x8BFB;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x606D;&#x559C;&#x4F60;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x5F3A;&#x8FC7;&#x5F88;&#x591A;&#x4EBA;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x7B2C;&#x56DB;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x300A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x300B;&#x4E00;&#x4E66;&#x7684;&#x5B8C;&#x6574;&#x6807;&#x9898;&#x662F;&#xFF1A;&#x201C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x2014;&#x2014;&#x53EF;&#x590D;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8F6F;&#x4EF6;&#x7684;&#x57FA;&#x7840;&#x201D;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF0C;&#x4E0D;&#x662F;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7F16;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x5177;&#x5907;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x672A;&#x80FD;&#x4EE5;&#x5BF9;&#x8C61;&#x4E3A;&#x6838;&#x5FC3;&#x6765;&#x67B6;&#x6784;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x7528;&#x5F97;&#x4E0A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x8981;&#x4ECE;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BF4;&#x8D77;&#x3002;</p>
<h2 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;">&#x9762;&#x5411;&#x5BF9;&#x8C61;</h2>
<p>&#x8003;&#x8651;&#x5230;&#x6709;&#x4E9B;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x4E0D;&#x719F;&#x6089;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF08;&#x7B80;&#x79F0; OOP&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x4E0E;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x540E;&#x8005;&#x628A;&#x7A0B;&#x5E8F;&#x5F53;&#x6210;&#x4E00;&#x7CFB;&#x5217;&#x6307;&#x4EE4;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5219;&#x8BA4;&#x4E3A;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x201C;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x4E00;&#x8D77;&#x6765;&#x5B8C;&#x6210;&#x4E00;&#x9879;&#x5DE5;&#x4F5C;&#x201D;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x4E1C;&#x897F;&#x201D;&#xFF0C;&#x5C31;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x80FD;&#x5B8C;&#x6210;&#x7279;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x62C6;&#x5206;&#x529F;&#x80FD;&#xFF0C;&#x5F62;&#x6210;&#x82E5;&#x5E72;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x4EA4;&#x4EE3;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x6765;&#x5B8C;&#x6210;&#x7279;&#x5B9A;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x6211;&#x4EEC;&#x8981;&#x5F00;&#x53D1;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x7ED9;&#x6240;&#x6709;&#x540C;&#x4E8B;&#x7B97;&#x5DE5;&#x8D44;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4EE5;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5199;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5927;&#x6982;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<ol>
<li>&#x53D6;&#x51FA;&#x6240;&#x6709;&#x540C;&#x4E8B;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x53D6;&#x51FA;&#x6240;&#x6709;&#x540C;&#x4E8B;&#x7684;&#x8003;&#x52E4;&#x3002;</li>
<li>&#x53D6;&#x51FA;&#x6240;&#x6709;&#x540C;&#x4E8B;&#x7684;&#x7EE9;&#x6548;&#x6253;&#x5206;&#x3002;</li>
<li>&#x53D6;&#x51FA;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x5047;&#x3001;&#x75C5;&#x5047;&#x3001;&#x5E74;&#x5047;&#xFF0C;&#x501F;&#x6B3E;&#x62A5;&#x9500;&#x62B5;&#x6263;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x3002;</li>
<li>&#x5408;&#x5E76;&#x4EE5;&#x4E0A;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x7B97;&#x51FA;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5DE5;&#x8D44;&#xFF0C;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x3002;</li>
</ol>
<p>&#x770B;&#x8D77;&#x6765;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x521A;&#x521A;&#x5199;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x5E38;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x3001;&#x7ED3;&#x6784;&#x6E05;&#x6670;&#x3001;&#x7B80;&#x5355;&#x6613;&#x61C2;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x4E00;&#x5F00;&#x59CB;&#x5199;&#x7684;&#x90FD;&#x662F;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x65E2;&#x6EE1;&#x8DB3;&#x4E86;&#x9700;&#x6C42;&#xFF0C;&#x9605;&#x8BFB;&#x8D77;&#x6765;&#x4E5F;&#x5F88;&#x8F7B;&#x677E;&#xFF1B;&#x5982;&#x679C;&#x66F4;&#x52AA;&#x529B;&#x4E00;&#x4E9B;&#xFF0C;&#x5728;&#x5404;&#x4E2A;&#x6B65;&#x9AA4;&#x5F53;&#x4E2D;&#x52A0;&#x8FDB;&#x53BB;&#x4E00;&#x4E9B;&#x6CE8;&#x91CA;&#xFF0C;&#x7B80;&#x76F4;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5F88;&#x5FEB;&#x9700;&#x6C42;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF1A;</p>
<ol>
<li>&#x9996;&#x5148;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x5DE5;&#x8D44;&#x5E76;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x6708;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x6BD4;&#x5982;&#x8FC7;&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x53D1;&#x5E74;&#x7EC8;&#x5956;&#xFF1B;&#x5929;&#x70ED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x516C;&#x53F8;&#x4E5F;&#x53EF;&#x80FD;&#x7ED9;&#x5927;&#x5BB6;&#x53D1;&#x4E00;&#x4E9B;&#x964D;&#x6E29;&#x8D39;&#x3002;</li>
<li>&#x516C;&#x53F8;&#x7684;&#x4E1A;&#x52A1;&#x51FA;&#x73B0;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x540C;&#x4E8B;&#x7684;&#x5E95;&#x85AA;&#x4E0B;&#x8C03;&#xFF0C;&#x7EE9;&#x6548;&#x6BD4;&#x91CD;&#x589E;&#x52A0;&#x3002;</li>
<li>&#x4E0D;&#x540C;&#x5C97;&#x4F4D;&#x5BF9;&#x5230;&#x5C97;&#x65F6;&#x95F4;&#x8981;&#x6C42;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x9500;&#x552E;&#x8981;&#x62DC;&#x8BBF;&#x5BA2;&#x6237;&#xFF0C;&#x5176;&#x5B83;&#x90E8;&#x95E8;&#x90FD;&#x8981;&#x51C6;&#x70B9;&#x4E0A;&#x4E0B;&#x73ED;&#xFF0C;&#x8003;&#x6838;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#x3002;</li>
<li>&#x9664;&#x4E86;&#x7EB5;&#x5411;&#x7684;&#x5C97;&#x4F4D;&#x5DE5;&#x8D44;&#xFF0C;&#x8FD8;&#x6709;&#x6A2A;&#x5411;&#x7684;&#x9879;&#x76EE;&#x5956;&#x91D1;&#xFF0C;&#x5373;&#x4F7F;&#x540C;&#x5C5E;&#x4E00;&#x4E2A;&#x90E8;&#x95E8;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x5404;&#x79CD;&#x7CFB;&#x6570;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x3002;</li>
<li>&#x2026;&#x2026;</li>
</ol>
<p>&#x968F;&#x7740;&#x9700;&#x6C42;&#x53D8;&#x5316;&#xFF0C;&#x4EE3;&#x7801;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x81C3;&#x80BF;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x52A0;&#x5165;&#x5404;&#x79CD; <code>if ... else ...</code>&#xFF0C;&#x4EE3;&#x7801;&#x884C;&#x6570;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x751A;&#x81F3;&#x4E0A;&#x6DA8;&#x5230;&#x51E0;&#x5343;&#x884C;&#x3002;&#x6B64;&#x65F6;&#x7684;&#x4EE3;&#x7801;&#x51E0;&#x4E4E;&#x4E0D;&#x80FD;&#x7EF4;&#x62A4;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x91CC;&#x7684;&#x4E00;&#x5904;&#x6539;&#x52A8;&#x4F1A;&#x5BF9;&#x540E;&#x9762;&#x9020;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x5C1D;&#x8BD5;&#x91CD;&#x6784;&#xFF0C;&#x52A0;&#x5165;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x65E0;&#x6D4E;&#x4E8E;&#x4E8B;&#xFF0C;&#x6218;&#x7565;&#x95EE;&#x9898;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x6218;&#x672F;&#x6765;&#x5F25;&#x8865;&#x3002;</p>
<h3 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x89E3;&#x6CD5;">&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x89E3;&#x6CD5;</h3>
<p>&#x8FD8;&#x662F;&#x521A;&#x624D;&#x90A3;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x6362;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF0C;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;</p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x662F;&#x53D6;&#x51FA;&#x6240;&#x6709;&#x5458;&#x5DE5;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x7D27;&#x63A5;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5148;&#x628A;&#x5176;&#x5B83;&#x6570;&#x636E;&#x90FD;&#x53D6;&#x51FA;&#x6765;&#x5907;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7B49;&#x4E0B;&#x518D;&#x6309;&#x9700;&#x53D6;&#x7528;&#x3002;&#x9664;&#x975E;&#x4F60;&#x8FEB;&#x5207;&#x5E0C;&#x671B;&#x51CF;&#x5C11;&#x8FDE;&#x63A5;&#x6B21;&#x6570;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x63A8;&#x8350;&#x4F60;&#x9009;&#x7528;&#x540E;&#x8005;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#x4E86;&#xFF1A;</p>
<ol>
<li>&#x6211;&#x4EEC;&#x4F1A;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x201C;&#x5458;&#x5DE5;&#x201D;&#x57FA;&#x7C7B;&#xFF0C;&#x5305;&#x542B;&#x57FA;&#x7840;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x5E95;&#x85AA;&#x3001;&#x5956;&#x91D1;&#x3001;&#x7EE9;&#x6548;&#x3001;&#x8003;&#x52E4;&#x7B49;&#xFF0C;&#x7136;&#x540E;&#x8D4B;&#x4E88;&#x5176;&#x6700;&#x57FA;&#x7840;&#x7684;&#x8BA1;&#x916C;&#x7B97;&#x6CD5;</li>
<li>&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5458;&#x5DE5;&#x7C7B;&#x578B;&#xFF0C;&#x6784;&#x5EFA;&#x8BF8;&#x5982;&#x201C;&#x5F00;&#x53D1;&#x201D;&#x3001;&#x201C;&#x9500;&#x552E;&#x201D;&#x7B49;&#x5B50;&#x7C7B;</li>
<li>&#x5B50;&#x7C7B;&#x8986;&#x5199;&#x7236;&#x7C7B;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7279;&#x6B8A;&#x7684;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;</li>
<li>&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x628A;&#x52A0;&#x51CF;&#x6B3E;&#x9879;&#x62BD;&#x8C61;&#x6210;&#x522B;&#x7684;&#x8BA1;&#x7B97;&#x57FA;&#x7C7B;&#x548C;&#x5B50;&#x7C7B;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x7279;&#x6B8A;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x6E90;&#x53D6;&#x6570;&#x636E;</li>
</ol>
<p>&#x5982;&#x6B64;&#x4E00;&#x6765;&#xFF0C;&#x4E00;&#x5927;&#x6BB5;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x5206;&#x89E3;&#x6210;&#x5341;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#xFF0C;&#x7C7B;&#x4E4B;&#x95F4;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7EE7;&#x627F;&#x548C;&#x5D4C;&#x5957;&#x5173;&#x7CFB;&#xFF0C;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x4F3C;&#x4E4E;&#x53D8;&#x590D;&#x6742;&#x4E86;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7C7B;&#x91CC;&#x9762;&#x7684;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x6BCF;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x4E8C;&#x4E09;&#x5341;&#x884C;&#x800C;&#x5DF2;&#xFF0C;&#x7406;&#x89E3;&#x548C;&#x7EF4;&#x62A4;&#x90FD;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x5047;&#x8BBE;&#x9700;&#x6C42;&#x53D8;&#x5316;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x65B0;&#x589E;&#x4E00;&#x79CD;&#x5C97;&#x4F4D;&#x7C7B;&#x578B;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x5C97;&#x4F4D;&#x7684;&#x7B97;&#x6CD5;&#x6709;&#x6240;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EA;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x65B0;&#x7C7B;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x5373;&#x53EF;&#x3002;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x3002;</p>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x5C31;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5B83;&#x5E76;&#x975E;&#x6765;&#x51FA;&#x81EA;&#x672C;&#x80FD;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5148;&#x7406;&#x89E3;&#x9700;&#x6C42;&#xFF0C;&#x8BBE;&#x8BA1;&#x62BD;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x5B9E;&#x73B0;&#x3002;&#x77ED;&#x671F;&#x6765;&#x770B;&#xFF0C;&#x4ECE;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x5230;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF0C;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x589E;&#x52A0;&#xFF1B;&#x4F46;&#x662F;&#x957F;&#x671F;&#x6765;&#x770B;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x903B;&#x8F91;&#x7B80;&#x5355;&#x6E05;&#x6670;&#x660E;&#x4E86;&#xFF0C;&#x4EE3;&#x7801;&#x590D;&#x7528;&#x5927;&#x5927;&#x589E;&#x52A0;&#xFF0C;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x548C;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x8FDC;&#x8FDC;&#x4F18;&#x4E8E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3002;</p>
<h2 id="&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</h2>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x7F3A;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x4EBA;&#x4E0E;&#x4EBA;&#x5BF9;&#x4E16;&#x754C;&#x7684;&#x8BA4;&#x8BC6;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E2A;&#x4EBA;&#x8BBE;&#x8BA1;&#x7684;&#x5BF9;&#x8C61;&#x7ED3;&#x6784;&#x90FD;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#xFF0C;&#x4E8E;&#x662F;&#x9605;&#x8BFB;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6548;&#x7387;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;&#x957F;&#x65F6;&#x95F4;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x4E4B;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x524D;&#x8F88;&#x8FBE;&#x4EBA;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x80FD;&#x591F;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x5584;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x7684;&#x65B9;&#x5F0F;&#x65B9;&#x6CD5;&#xFF0C;&#x4FBF;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x7406;&#x89E3;&#x548C;&#x5B66;&#x4F1A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5BF9;&#x6211;&#x4EEC;&#x4E4B;&#x540E;&#x5F00;&#x53D1;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x4E3B;&#x52A8;&#x4F7F;&#x7528;&#x8FC7;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x79BB;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x8FDC;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x63D0;&#x51FA;&#x4E8E;1990&#x5E74;&#xFF0C;&#x8DDD;&#x4ECA;&#x5C06;&#x8FD1;30&#x5E74;&#xFF0C;&#x65E9;&#x5DF2;&#x6E17;&#x5165;&#x5404;&#x79CD;&#x6D41;&#x884C;&#x8F6F;&#x4EF6;&#x7684;&#x8BBE;&#x8BA1;&#x5F53;&#x4E2D;&#x3002;&#x4EE5;&#x6211;&#x4EEC; Web &#x524D;&#x7AEF;&#x4E3A;&#x4F8B;&#xFF0C;&#x9664;&#x4E86;&#x672C;&#x6587;&#x5C06;&#x91CD;&#x70B9;&#x8BB2;&#x8FF0;&#x7684;&#x51E0;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E4B;&#x5916;&#xFF0C;DOM &#x4E8B;&#x4EF6;&#x673A;&#x5236;&#x5C31;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF08;Observer&#xFF09;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x800C; JS &#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x94FE;&#x6A21;&#x5F0F;&#xFF08;Prototype&#xFF09;&#x6253;&#x9020;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x7B80;&#x5386;&#x91CC;&#x5199;&#x7740;&#x201C;&#x719F;&#x6089;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x7B54;&#x51FA;&#x5355;&#x4F8B;&#xFF08;Singleton&#xFF09;&#x548C;&#x89C2;&#x5BDF;&#x8005;&#x7684;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#x90FD;&#x4E0D;&#x5408;&#x683C;&#x3002;&#x4E0E;&#x8BF8;&#x541B;&#x5171;&#x52C9;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x60A8;&#x4F7F;&#x7528;&#x8FC7;&#x73B0;&#x4EE3; MVVM &#x6846;&#x67B6;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x591A;&#x534A;&#x4E5F;&#x7528;&#x8FC7;&#x5176;&#x4E2D;&#x7684;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x6BD4;&#x5982; Vuex&#x3002;&#x5B83;&#x662F;&#x4ECE;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#xFF08;Meidator&#xFF09;&#x6F14;&#x5316;&#x800C;&#x6765;&#x7684;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x4E2D;&#x5DF2;&#x7ECF;&#x5728;&#x4EAB;&#x53D7;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5E26;&#x6765;&#x7684;&#x4FBF;&#x5229;&#x6027;&#x548C;&#x9AD8;&#x6548;&#x7387;&#x4E86;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;">&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</h2>
<p>&#x9700;&#x8981;&#x5927;&#x5BB6;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x65F6;&#x8FC7;&#x5883;&#x8FC1;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x4E0E;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x76F8;&#x6BD4;&#xFF0C;&#x53D8;&#x5316;&#x5DE8;&#x5927;&#x3002;&#x5982;&#x4ECA;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x5E73;&#x53F0;&#xFF0C;&#x65E0;&#x8BBA;&#x5728; API &#x8BBE;&#x8BA1;&#x3001;&#x8BED;&#x6CD5;&#x8BBE;&#x8BA1;&#x3001;&#x62BD;&#x8C61;&#x7A0B;&#x5EA6;&#xFF0C;&#x90FD;&#x4E0D;&#x53EF;&#x540C;&#x65E5;&#x800C;&#x8BED;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x5728;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5343;&#x4E07;&#x8981;&#x4E0E;&#x65F6;&#x4FF1;&#x8FDB;&#x3002;&#x4E0D;&#x8981;&#x76F2;&#x76EE;&#x7684;&#x53BB;&#x7167;&#x642C;&#x4E00;&#x4E9B;&#x4E66;&#x4E0A;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x7167;&#x6284;&#x4E66;&#x4E0A;&#x7684;&#x793A;&#x8303;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x539F;&#x578B;&#x94FE;&#xFF0C;&#x662F; JS &#x7684;&#x57FA;&#x7840;&#x8BBE;&#x8BA1;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x539F;&#x751F;&#x8BBE;&#x8BA1;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;ES6 &#x91CC;&#x65B0;&#x589E;&#x7684; Proxy &#x548C; Decorator&#xFF0C;&#x4E5F;&#x63D0;&#x4F9B;&#x539F;&#x751F;&#x7684;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x548C;&#x88C5;&#x9970;&#x5668;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x8BB2;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x4E66;&#x548C;&#x6587;&#x7AE0;&#xFF0C;&#x90FD;&#x4F1A;&#x6559;&#x4F60;&#x5148;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x6784;&#x5EFA;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x4FDD;&#x8BC1;&#x5728;&#x6240;&#x6709;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5C31;&#x53EB;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x6559;&#x6761;&#x4E3B;&#x4E49;&#x3002;&#x56E0;&#x4E3A; JS &#x5F00;&#x53D1;&#x573A;&#x666F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x65E0;&#x8BBA;&#x7528; CommonJS &#x8FD8;&#x662F; ES Module&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5; <code>export</code> &#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x7684;&#x884C;&#x4E3A;&#x6A21;&#x5F0F;&#x5B8C;&#x5168;&#x7B49;&#x6548;&#x4E8E;&#x5355;&#x4F8B;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x9002;&#x7528;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x8131;&#x79BB;&#x90A3;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x5B83;&#x7684;&#x4EF7;&#x503C;&#x5C31;&#x96BE;&#x4EE5;&#x53D1;&#x6325;&#xFF0C;&#x751A;&#x81F3;&#x7ED9;&#x65E5;&#x540E;&#x6316;&#x4E0B;&#x5927;&#x5751;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x8981;&#x523B;&#x610F;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x8981;&#x60F3;&#x6B63;&#x786E;&#x5730;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#xFF1A;</p>
<ol>
<li>&#x5148;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x80FD;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x95EE;&#x9898;</li>
<li>&#x9047;&#x5230;&#x95EE;&#x9898;&#x65F6;&#x60F3;&#x4E00;&#x60F3;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;</li>
<li>&#x5982;&#x679C;&#x6709;&#xFF0C;&#x56DE;&#x53BB;&#x8BA4;&#x771F;&#x5B66;&#x4E60;&#x90A3;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1A;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x505A;&#x7684;&#x3001;&#x6709;&#x54EA;&#x4E9B;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF0C;&#x7B49;&#x7B49;</li>
<li>&#x7528;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x89E3;&#x51B3;&#x95EE;&#x9898;</li>
</ol>
<p>&#x5982;&#x6B64;&#x91CD;&#x590D;&#x4E24;&#x4E09;&#x6B21;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5C31;&#x4F1A;&#x7262;&#x7262;&#x7684;&#x5370;&#x5728;&#x4F60;&#x7684;&#x8111;&#x6D77;&#x91CC;&#xFF0C;&#x6210;&#x4E3A;&#x4F60;&#x7684;&#x5E38;&#x89C4;&#x6B66;&#x5668;&#x3002;&#x6BD4;&#x5982;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5458;&#x5DE5;&#x5DE5;&#x8D44;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x6536;&#x83B7;&#x5947;&#x6548;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4F60;&#x597D;&#x51E0;&#x5E74;&#x90FD;&#x6CA1;&#x6709;&#x7528;&#x5230;&#xFF0C;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x5F88;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x3001;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x3001;&#x5F00;&#x53D1;&#x4F53;&#x7CFB;&#x3001;&#x4F60;&#x7684;&#x7528;&#x6237;&#x7FA4;&#x4F53;&#xFF0C;&#x90FD;&#x4E0D;&#x592A;&#x9700;&#x8981;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x6A21;&#x5F0F;&#xFF0C;&#x4F60;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x7528;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x539F;&#x578B;&#x94FE;&#x6A21;&#x5F0F;&#x3001;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x3001;&#x88C5;&#x9970;&#x5668;&#x6A21;&#x5F0F;&#xFF0C;JS &#x91CC;&#x90FD;&#x6709;&#x539F;&#x751F;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x4F1A;&#x7528;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4F1A;&#x4ECE;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x53D1;&#x73B0;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x6CD5;&#x548C;&#x4EF7;&#x503C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4F1A;&#x4ECB;&#x7ECD;&#x90A3;&#x4E9B;&#x5E2E;&#x52A9; jQuery &#x53D6;&#x5F97;&#x6210;&#x529F;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x5728;&#x5176;&#x5B83;&#x5E93;&#x548C;&#x6846;&#x67B6;&#x91CC;&#xFF0C;&#x5E38;&#x5E38;&#x4E5F;&#x5B58;&#x5728;&#x5F88;&#x597D;&#x7684;&#x4F7F;&#x7528;&#x8303;&#x4F8B;&#xFF0C;&#x6BD4;&#x5982; Vuex &#x91CC;&#x7528;&#x5230;&#x4E2D;&#x4ECB;&#x6A21;&#x5F0F;&#x548C;&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#xFF08;Memonto&#xFF09;&#x3001;&#x6BD4;&#x5982; Express &#x4E2D;&#x7528;&#x5230;&#x804C;&#x8D23;&#x94FE;&#x6A21;&#x5F0F;&#xFF08;Chain of Responsibility&#xFF09;&#x3002;</p>
<p>&#x5148;&#x77E5;&#x6653;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x5B9E;&#x9645;&#x7528;&#x4F8B;&#x5F53;&#x4E2D;&#x5B66;&#x4F1A;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x6700;&#x540E;&#x5B66;&#x4F1A;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x662F;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8DEF;&#x5F84;&#x3002;</p>
<p>&#x518D;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x524D;&#x7AEF;&#x540C;&#x5B66;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ol>
<li>&#x4E0D;&#x8981;&#x523B;&#x677F;&#x7167;&#x642C;&#x4E66;&#x4E0A;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;</li>
<li>&#x627E;&#x4E2A;&#x673A;&#x4F1A;&#x628A;&#x6240;&#x6709;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x770B;&#x4E00;&#x904D;&#xFF0C;&#x5728;&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x5F53;&#x4E2D;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;</li>
<li>&#x53D1;&#x73B0;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</li>
<li>&#x4ECE;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x5F53;&#x4E2D;&#xFF0C;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</li>
</ol>
<p>OK&#xFF0C;&#x5173;&#x4E8E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x548C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x8981;&#x8BF4;&#x7684;&#x5927;&#x6982;&#x5C31;&#x8BF4;&#x5B8C;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x7B2C;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1A;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="factory-pattern.html" class="navigation navigation-next " aria-label="Next page: 工厂模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"设计模式与面向对象","level":"1.2","depth":1,"next":{"title":"工厂模式","level":"1.3","depth":1,"path":"factory-pattern.md","ref":"factory-pattern.md","articles":[]},"previous":{"title":"前言","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"从 jQuery 中学习设计模式","language":"zh","gitbook":"*","description":"jQuery 能取得如此成功，设计模式功不可没。但是，由于 JavaScript 里缺少面向对象的习惯，所以很多同学并不了解。本文就结合 jQuery 里最受欢迎的一些特性，讲解设计模式是如何工作的。"},"file":{"path":"oop-design-pattern.md","mtime":"2019-08-01T02:12:48.320Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-08-31T08:54:33.968Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

